In [1]:
# 7 Handling Dates and Times 
import numpy as np 
import pandas as pd

In [2]:
# 7.1 converting strings to dates 
date_strings = np.array(['03-04-2005 11:35 PM',
                         '23-05-2010 12:01 AM',
                         '04-09-2009 09:09 PM'])
[pd.to_datetime(data, format="%d-%m-%Y %I:%M %p", errors="coerce") for data in date_strings]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

In [3]:
# 7.2 Handling TIme Zones 
pd.Timestamp('2017-05-01 06:00:00', tz='Europe/London')

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [4]:
date = pd.Timestamp('2017-05-01 06:00:00')
date_in_london = date.tz_localize("Europe/London")
date_in_london

Timestamp('2017-05-01 06:00:00+0100', tz='Europe/London')

In [5]:
date_in_london.tz_convert('Africa/Abidjan')

Timestamp('2017-05-01 05:00:00+0000', tz='Africa/Abidjan')

In [7]:
dates = pd.Series(pd.date_range('2/2/2002', periods = 3, freq='M'))
dates.dt.tz_localize('Africa/Abidjan')

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_2192/3543259383.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.Series(pd.date_range('2/2/2002', periods = 3, freq='M'))

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

In [8]:
from pytz import all_timezones

all_timezones[:2]

['Africa/Abidjan', 'Africa/Accra']

In [9]:
# 7.3 Selecting Dates and TImes 
dataframe = pd.DataFrame() 
dataframe['date'] = pd.date_range('1/1/2001', periods=100000, freq='H')
dataframe[(dataframe['date'] > '2002-1-1 01:00:00') &
          (dataframe['date'] <= '2002-1-1 04:00:00')]

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_2192/922385216.py:3: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  dataframe['date'] = pd.date_range('1/1/2001', periods=100000, freq='H')

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

In [12]:
# 7.4 Breaking Up Date Data into Multiple Features 
dataframe = pd.DataFrame() 
dataframe['date'] = pd.date_range('1/1/2001', periods= 150, freq='W')
dataframe['year'] = dataframe['date'].dt.year
dataframe['month'] = dataframe['date'].dt.month
dataframe['day'] = dataframe['date'].dt.day
dataframe['hour'] = dataframe['date'].dt.hour
dataframe['minute'] = dataframe['date'].dt.minute

In [13]:
dataframe

          date  year  month  day  hour  minute
0   2001-01-07  2001      1    7     0       0
1   2001-01-14  2001      1   14     0       0
2   2001-01-21  2001      1   21     0       0
3   2001-01-28  2001      1   28     0       0
4   2001-02-04  2001      2    4     0       0
..         ...   ...    ...  ...   ...     ...
145 2003-10-19  2003     10   19     0       0
146 2003-10-26  2003     10   26     0       0
147 2003-11-02  2003     11    2     0       0
148 2003-11-09  2003     11    9     0       0
149 2003-11-16  2003     11   16     0       0

[150 rows x 6 columns]

In [14]:
# 7.5 calculating the difference between Dates 
dataframe = pd.DataFrame() 
dataframe['Arrived'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-04-2017')]
dataframe['Left'] = [pd.Timestamp('01-01-2017'), pd.Timestamp('01-06-2017')]

dataframe['Left'] - dataframe['Arrived']

0   0 days
1   2 days
dtype: timedelta64[ns]

In [15]:
pd.Series(delta.days for delta in (dataframe['Left'] - dataframe['Arrived']))

0    0
1    2
dtype: int64

In [20]:
# 7.6 Encoding days of the week 

dates = pd.Series(pd.date_range("2/2/2002", periods=3, freq="M"))
dates.dt.weekday

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_2192/3119881490.py:3: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.Series(pd.date_range("2/2/2002", periods=3, freq="M"))

0    3
1    6
2    1
dtype: int32

In [22]:
# 7.7 Creating a lagged feature 
dataframe = pd.DataFrame() 
dataframe['date'] = pd.date_range('1/1/2001', periods=5, freq='D')
dataframe["stock_price"] = [1.1,2.2,3.3,4.4,5.5]
dataframe["previous_days_stock_price"] = dataframe["stock_price"].shift(1)
dataframe

        date  stock_price  previous_days_stock_price
0 2001-01-01          1.1                        NaN
1 2001-01-02          2.2                        1.1
2 2001-01-03          3.3                        2.2
3 2001-01-04          4.4                        3.3
4 2001-01-05          5.5                        4.4

In [24]:
# 7.8 Using rolling time windows 
time_index = pd.date_range("01/01/2010", periods=5, freq="M")
dataframe = pd.DataFrame(index=time_index)
dataframe['stock_price'] = [1,2,3,4,5]
print(dataframe)
dataframe.rolling(window=2).mean()

            stock_price
2010-01-31            1
2010-02-28            2
2010-03-31            3
2010-04-30            4
2010-05-31            5

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_2192/2127538598.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  time_index = pd.date_range("01/01/2010", periods=5, freq="M")

            stock_price
2010-01-31          NaN
2010-02-28          1.5
2010-03-31          2.5
2010-04-30          3.5
2010-05-31          4.5

In [26]:
# 7.9 handling missing data in time series 
time_index = pd.date_range('01/01/2010', periods=5, freq='M')
dataframe = pd.DataFrame(index=time_index)
dataframe["Sales"] = [1.0,2.0,np.nan,np.nan,5.0]
dataframe

/var/folders/zp/lh41kzf50154vjcdgp1dj1100000gn/T/ipykernel_2192/2675811047.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  time_index = pd.date_range('01/01/2010', periods=5, freq='M')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    NaN
2010-04-30    NaN
2010-05-31    5.0

In [27]:
dataframe.interpolate()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

In [28]:
dataframe.ffill() # replace missing values with the last known value

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

In [29]:
dataframe.bfill() # replace missing values with the next known value

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

In [30]:
dataframe.interpolate(method="quadratic")

               Sales
2010-01-31  1.000000
2010-02-28  2.000000
2010-03-31  3.059808
2010-04-30  4.038069
2010-05-31  5.000000

In [31]:
dataframe.interpolate(limit=1, limit_direction="forward")

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0